<?php

namespace ALS\Helper;

class Form {
    /**
     * Функция возвращает паттерн для заполнения полей согласно запрашиваемому типу <br>
     * Например, доступны следующие типы: <br>
     * <li> NAME
     * <li> FIO
     * <li> PHONE
     * <li> EMAIL
     * @param string $type Строка с типом паттерна
     * @return string Сам паттерн для регулярного выражения
     */
    public static function getPattern($type) {
        $arPattern = [
            'NAME'  => '/^.{3,}$/',
            'FIO'   => '/^.{6,}$/',
            'PHONE' => '/^(?=[^()]*\(([^()]*\)[^()]*)?$|[^()]*$)(?=[\s(]*\+[^+]*$|[^+]*$)([-+.\s()]*\d){11,18}$/',
            'EMAIL' => "/^[a-zA-Z0-9а-яА-ЯёЁ\x{0600}-\x{06FF}!#$%&'*+\/=?^_`{|}~-]+(?:\.[a-zA-Z0-9а-яА-ЯёЁ\x{0600}-\x{06FF}!#$%&'*+\/=?^_`{|}~-]+)*@(?:[a-zA-Z0-9а-яА-ЯёЁ\x{0600}-\x{06FF}](?:[a-zA-Z0-9а-яА-ЯёЁ\x{0600}-\x{06FF}-]*[a-zA-Z0-9а-яА-ЯёЁ\x{0600}-\x{06FF}])?\.)+[a-zA-Z0-9а-яА-ЯёЁ\x{0600}-\x{06FF}](?:[a-zA-Z0-9а-яА-ЯёЁ\x{0600}-\x{06FF}-]*[a-zA-Z0-9а-яА-ЯёЁ\x{0600}-\x{06FF}])?$/u",
        ];

        return $arPattern[$type];
    }

}
